# Loading the Dataset

In [1]:
import pandas as pd

# Load the dataset
data = pd.read_csv('/content/train (1).csv')

In [4]:
print(data)

      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage  \
0                 41000    Diesel       Manual      First  19.67 kmpl
1                 46000    Petrol       Manual      First    13 km/kg
2                 87000    Diesel       Manual      First  20.77 kmpl
3                 40670    Diesel    Automatic     Second   15.2 kmpl
4                 86999    Diesel       Manual      First  23.08 kmpl
...                 ...       ...          ...        ...         ...
5842              27365    Diesel       Manual      First   28.4 kmpl
5843             100000    Diesel       Manual      First   24.4 kmpl
5844              55000    Diesel       Manual     Second   14.0 kmpl
5845              46000    Petrol       Manual      First   18.9 kmpl
5846              47000    Diesel       Manual      First  25.44 kmpl

       Engine      Power  Seats  New_Price  Price
0     1582 CC  126.2 bhp    5.0        NaN  12.50
1     1199 CC   88.7 bhp    5.0  8.61 Lakh   4.50
2     1248 CC  88.76 bhp    7.0        NaN   6.00
3     1968 CC  140.8 bhp    5.0        NaN  17.74
4     1461 CC   63.1 bhp    5.0        NaN   3.50
...       ...        ...    ...        ...    ...
5842  1248 CC     74 bhp    5.0  7.88 Lakh   4.75
5843  1120 CC     71 bhp    5.0        NaN   4.00
5844  2498 CC    112 bhp    8.0        NaN   2.90
5845   998 CC   67.1 bhp    5.0        NaN   2.65
5846   936 CC   57.6 bhp    5.0        NaN   2.50

[5847 rows x 14 columns]

# Check Mising values in the given dataset

In [2]:
# Check for missing values in the given dataset
missing_values = data.isnull().sum()
print("Missing values in each column:")
print(missing_values)

Missing values in each column:
Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

# a) Look for the missing values in all the columns and either impute them (replace with mean,median, or mode) or drop them. Justify your action for this task.

In [5]:
# Impute missing values with mode
data['Mileage'].fillna(data['Mileage'].mode()[0], inplace=True)
data['Engine'].fillna(data['Engine'].mode()[0], inplace=True)
data['Power'].fillna(data['Power'].mode()[0], inplace=True)
data['Seats'].fillna(data['Seats'].mode()[0], inplace=True)
data['New_Price'].fillna(data['New_Price'].mode()[0], inplace=True)

In [10]:
# We should avoid dropping the 'New_Price' column since it contains a significant amount of missing data. Removing this column could introduce predictive modeling challenges and bias the results, given its potential importance in understanding the pricing dynamics of used cars.
# So we can take any other column except new_price, here i'm taking price. Still it will not make any significant difference because as we can see there are 0 rows with null value
data.dropna(subset=['Price'], inplace=True)

In [11]:
# Check if missing values are handled
print("After handling missing values:")
print(data.isnull().sum())

After handling missing values:
Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

In [32]:
# Save the output dataset
data.to_csv('afterHandlingMissingValues.csv', index=False)

# b) Remove the units from some of the attributes and only keep the numerical values (for example remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from “New_price”).

In [12]:
# Remove units from attributes
# We use the str.extract() method along with regular expressions to extract numerical values from the specified attributes while removing the units.
data['Mileage'] = data['Mileage'].str.extract('(\d+.\d+)', expand=False)
data['Engine'] = data['Engine'].str.extract('(\d+)', expand=False)
data['Power'] = data['Power'].str.extract('(\d+.\d+)', expand=False)
data['New_Price'] = data['New_Price'].str.extract('(\d+.\d+)', expand=False)

In [14]:
# Convert data types to numeric
# After extraction, converting attributes to numeric types using `pd.to_numeric()` ensures only numerical values persist, facilitating subsequent analysis or processing.
data['Mileage'] = pd.to_numeric(data['Mileage'], errors='coerce')
data['Engine'] = pd.to_numeric(data['Engine'], errors='coerce')
data['Power'] = pd.to_numeric(data['Power'], errors='coerce')
data['New_Price'] = pd.to_numeric(data['New_Price'], errors='coerce')

In [15]:
# Display the modified dataset
print(data.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              41000    Diesel       Manual      First    19.67    1582
1              46000    Petrol       Manual      First      NaN    1199
2              87000    Diesel       Manual      First    20.77    1248
3              40670    Diesel    Automatic     Second    15.20    1968
4              86999    Diesel       Manual      First    23.08    1461

    Power  Seats  New_Price  Price
0  126.20    5.0       4.78  12.50
1   88.70    5.0       8.61   4.50
2   88.76    7.0       4.78   6.00
3  140.80    5.0       4.78  17.74
4   63.10    5.0       4.78   3.50

In [33]:
# Save the output dataset
data.to_csv('removingTheUnits.csv', index=False)

# c) Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.

In [16]:
# Convert categorical variables into one-hot encoded values
# To convert categorical variables into numerical one-hot encoded values, we can use the pd.get_dummies() function in pandas
data = pd.get_dummies(data, columns=['Fuel_Type', 'Transmission'])

In [17]:
print(data.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67    1582  126.20    5.0       4.78
1              46000      First      NaN    1199   88.70    5.0       8.61
2              87000      First    20.77    1248   88.76    7.0       4.78
3              40670     Second    15.20    1968  140.80    5.0       4.78
4              86999      First    23.08    1461   63.10    5.0       4.78

   Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
0  12.50                 1                   0                 0
1   4.50                 0                   0                 1
2   6.00                 1                   0                 0
3  17.74                 1                   0                 0
4   3.50                 1                   0                 0

   Transmission_Automatic  Transmission_Manual
0                       0                    1
1                       0                    1
2                       0                    1
3                       1                    0
4                       0                    1

In [34]:
# Save the output dataset
data.to_csv('hotEncodedValue.csv', index=False)

# d) Create one more feature and add this column to the dataset (you can use mutate function in R for this). For example, you can calculate the current age of the car by subtracting “Year” value from the current year.

In [19]:
import pandas as pd
from datetime import datetime

# Get the current year
current_year = datetime.now().year

# Calculate the current age of the car
data['Current_Age'] = current_year - data['Year']

In [20]:
print(data.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67    1582  126.20    5.0       4.78
1              46000      First      NaN    1199   88.70    5.0       8.61
2              87000      First    20.77    1248   88.76    7.0       4.78
3              40670     Second    15.20    1968  140.80    5.0       4.78
4              86999      First    23.08    1461   63.10    5.0       4.78

   Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
0  12.50                 1                   0                 0
1   4.50                 0                   0                 1
2   6.00                 1                   0                 0
3  17.74                 1                   0                 0
4   3.50                 1                   0                 0

   Transmission_Automatic  Transmission_Manual  Current_Age
0                       0                    1            9
1                       0                    1           13
2                       0                    1           12
3                       1                    0           11
4                       0                    1           11

In [35]:
# Save the output dataset
data.to_csv('addAColumnToTheDataset.csv', index=False)

# e) Perform select, filter, rename, mutate, arrange and summarize with group by operations (or their equivalent operations in python) on this dataset.

In [22]:
# Select operation: Select specific columns
selected_data = data[['Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type_Diesel', 'Fuel_Type_Electric', 'Fuel_Type_Petrol', 'Price']]

In [23]:
# Filter operation: Filter rows based on a condition
# Example filter condition: cars with price greater than 10 lakhs
filtered_data = data[data['Price'] > 10]

In [24]:
# Rename operation: Rename columns
renamed_data = data.rename(columns={'Kilometers_Driven': 'Kms_Driven'})

In [25]:
# Mutate operation: Create a new column based on existing columns
data['Mileage_per_Km'] = data['Mileage'] / data['Kilometers_Driven']

In [26]:
# Arrange operation: Sort the dataset based on a column
sorted_data = data.sort_values(by='Year', ascending=False)

In [27]:
# Summarize operation: Calculate summary statistics
summary_stats = data.describe()

In [30]:
# Group by operation: Group data based on a categorical variable and perform summary statistics
grouped_data = data.groupby('Fuel_Type_Diesel').agg({'Price': 'mean', 'Year': 'min', 'Kilometers_Driven': 'max'})

In [31]:
# Display the results
print("Selected Data:")
print(selected_data.head())

print("\nFiltered Data:")
print(filtered_data.head())

print("\nRenamed Data:")
print(renamed_data.head())

print("\nMutated Data:")
print(data.head())

print("\nSorted Data:")
print(sorted_data.head())

print("\nSummary Statistics:")
print(summary_stats)

print("\nGrouped Data:")
print(grouped_data)

Selected Data:
                               Name    Location  Year  Kilometers_Driven  \
0  Hyundai Creta 1.6 CRDi SX Option        Pune  2015              41000
1                      Honda Jazz V     Chennai  2011              46000
2                 Maruti Ertiga VDI     Chennai  2012              87000
3   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013              40670
4            Nissan Micra Diesel XV      Jaipur  2013              86999

   Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  Price
0                 1                   0                 0  12.50
1                 0                   0                 1   4.50
2                 1                   0                 0   6.00
3                 1                   0                 0  17.74
4                 1                   0                 0   3.50

Filtered Data:
    Unnamed: 0                               Name    Location  Year  \
0            1   Hyundai Creta 1.6 CRDi SX Option        Pune  2015
3            4    Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
5            7  Toyota Innova Crysta 2.8 GX AT 8S      Mumbai  2016
11          13   Land Rover Range Rover 2.2L Pure       Delhi  2014
12          14     Land Rover Freelander 2 TD4 SE        Pune  2012

    Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  New_Price  \
0               41000      First    19.67    1582  126.2    5.0       4.78
3               40670     Second    15.20    1968  140.8    5.0       4.78
5               36000      First    11.36    2755  171.5    8.0        NaN
11              72000      First    12.70    2179  187.7    5.0       4.78
12              85000     Second     0.00    2179  115.0    5.0       4.78

    Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
0   12.50                 1                   0                 0
3   17.74                 1                   0                 0
5   17.50                 1                   0                 0
11  27.00                 1                   0                 0
12  17.50                 1                   0                 0

    Transmission_Automatic  Transmission_Manual  Current_Age
0                        0                    1            9
3                        1                    0           11
5                        1                    0            8
11                       1                    0           10
12                       1                    0           12

Renamed Data:
   Unnamed: 0                              Name    Location  Year  Kms_Driven  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015       41000
1           2                      Honda Jazz V     Chennai  2011       46000
2           3                 Maruti Ertiga VDI     Chennai  2012       87000
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013       40670
4           6            Nissan Micra Diesel XV      Jaipur  2013       86999

  Owner_Type  Mileage  Engine   Power  Seats  New_Price  Price  \
0      First    19.67    1582  126.20    5.0       4.78  12.50
1      First      NaN    1199   88.70    5.0       8.61   4.50
2      First    20.77    1248   88.76    7.0       4.78   6.00
3     Second    15.20    1968  140.80    5.0       4.78  17.74
4      First    23.08    1461   63.10    5.0       4.78   3.50

   Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
0                 1                   0                 0
1                 0                   0                 1
2                 1                   0                 0
3                 1                   0                 0
4                 1                   0                 0

   Transmission_Automatic  Transmission_Manual  Current_Age
0                       0                    1            9
1                       0                    1           13
2                       0                    1           12
3                       1                    0           11
4                       0                    1           11

Mutated Data:
   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67    1582  126.20    5.0       4.78
1              46000      First      NaN    1199   88.70    5.0       8.61
2              87000      First    20.77    1248   88.76    7.0       4.78
3              40670     Second    15.20    1968  140.80    5.0       4.78
4              86999      First    23.08    1461   63.10    5.0       4.78

   Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
0  12.50                 1                   0                 0
1   4.50                 0                   0                 1
2   6.00                 1                   0                 0
3  17.74                 1                   0                 0
4   3.50                 1                   0                 0

   Transmission_Automatic  Transmission_Manual  Current_Age  Mileage_per_Km
0                       0                    1            9        0.000480
1                       0                    1           13             NaN
2                       0                    1           12        0.000239
3                       1                    0           11        0.000374
4                       0                    1           11        0.000265

Sorted Data:
      Unnamed: 0                             Name    Location  Year  \
5405        5560        Renault KWID RXT Optional       Kochi  2019
942          975  Ford Endeavour 2.2 Trend AT 4X2       Kochi  2019
5533        5690        Maruti Omni 5 Seater BSIV  Coimbatore  2019
770          796            Mahindra XUV500 W9 AT  Coimbatore  2019
4267        4399       Maruti Swift Dzire AMT ZDI     Chennai  2019

      Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  New_Price  \
5405               6568      First    25.17     799   53.3    5.0       4.78
942               11209      First    12.62    2198  158.0    7.0       4.78
5533               4721      First    14.00     796    NaN    5.0       4.78
770               19654      First    14.00    2179  155.0    7.0      21.33
4267              65000      First    26.59    1248    NaN    5.0       4.78

      Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
5405   5.09                 0                   0                 1
942   31.15                 1                   0                 0
5533   4.11                 0                   0                 1
770   17.63                 1                   0                 0
4267   6.75                 1                   0                 0

      Transmission_Automatic  Transmission_Manual  Current_Age  Mileage_per_Km
5405                       0                    1            5        0.003832
942                        1                    0            5        0.001126
5533                       0                    1            5        0.002965
770                        1                    0            5        0.000712
4267                       1                    0            5        0.000409

Summary Statistics:
        Unnamed: 0         Year  Kilometers_Driven      Mileage       Engine  \
count  5847.000000  5847.000000       5.847000e+03  5846.000000  5847.000000
mean   3013.181461  2013.448435       5.841013e+04    18.159632  1628.877031
std    1736.398890     3.194949       9.237971e+04     4.357372   601.078362
min       1.000000  1998.000000       1.710000e+02     0.000000    72.000000
25%    1509.500000  2012.000000       3.346750e+04    15.260000  1198.000000
50%    3015.000000  2014.000000       5.257600e+04    18.190000  1496.000000
75%    4517.500000  2016.000000       7.249050e+04    21.100000  1991.000000
max    6018.000000  2019.000000       6.500000e+06    28.400000  5998.000000

             Power        Seats    New_Price        Price  Fuel_Type_Diesel  \
count  4856.000000  5847.000000  5833.000000  5847.000000       5847.000000
mean    121.601744     5.284590     6.944262     9.653742          0.540619
std      55.523864     0.804372     9.293972    11.275966          0.498390
min      34.200000     2.000000     1.020000     0.440000          0.000000
25%      83.800000     5.000000     4.780000     3.550000          0.000000
50%     103.600000     5.000000     4.780000     5.750000          1.000000
75%     147.900000     5.000000     4.780000    10.250000          1.000000
max     560.000000    10.000000    99.920000   160.000000          1.000000

       Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Automatic  \
count         5847.000000       5847.000000             5847.000000
mean             0.000342          0.459039                0.292800
std              0.018493          0.498362                0.455086
min              0.000000          0.000000                0.000000
25%              0.000000          0.000000                0.000000
50%              0.000000          0.000000                0.000000
75%              0.000000          1.000000                1.000000
max              1.000000          1.000000                1.000000

       Transmission_Manual  Current_Age  Mileage_per_Km
count          5847.000000  5847.000000     5846.000000
mean              0.707200    10.551565        0.000620
std               0.455086     3.194949        0.002313
min               0.000000     5.000000        0.000000
25%               0.000000     8.000000        0.000235
50%               1.000000    10.000000        0.000350
75%               1.000000    12.000000        0.000566
max               1.000000    26.000000        0.144444

Grouped Data:
                      Price  Year  Kilometers_Driven
Fuel_Type_Diesel
0                  5.761988  1998             620000
1                 12.960686  1998            6500000

In [36]:
# Save the output dataset
data.to_csv('afterPerformingAllTheOperations.csv', index=False)